app/controllers/recipes_controller.rb

INSERT INTO "recipes" ("title", "instructions", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Pastel de choclo"], ["instructions", "1.-Choclo\r\n2.-Carne molida"], ["created_at", "2022-06-29 03:03:15.419009"], ["updated_at", "2022-06-29 03:03:15.419009"]]
---
  def create
    @recipe = Recipe.new(recipe_params)

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "instructions" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["instructions", "1.-bla\n2.-bla\n3.-bla\n4.-Sin tomates"], ["updated_at", "2022-06-29 01:25:12.100156"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)